In [1]:
# pandasが使えるようにインポート
import pandas as pd

In [2]:
# pandasでデータフレームの作成
df = pd.DataFrame([[1, 2, 3],[4, 5, 6],[7, 8, 9]],
                  columns = ['col01', 'col02', 'col03'],
                  index = ['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [3]:
# numpyとは高速にリストの計算をするためのライブラリをimport
import numpy as np

In [4]:
# pandasでデータフレームの作成  arrayは配列を作る
df = pd.DataFrame(np.array([[1, 2, 3],[4, 5, 6],[7, 8, 9]]),
                  columns = ['col01', 'col02', 'col03'],
                  index = ['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [5]:
# indexの値を取得
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [6]:
# columnsの値を取得
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [7]:
# 辞書型を使った制作方法
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [8]:
# 辞書型を使った制作方法と
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]})
# indexがないので作る。
df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [9]:
# 最初からindexをつけて制作方法
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9]}
                 ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [10]:
# リストでColumnsとindexを指定しないDataFrameを制作
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
# columnsとindexの指定
df.columns=['col01', 'col02', 'col03']
df.index=['idx01','idx02','idx03']

In [13]:
df # 確認

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [14]:
# columns名の変更
df.columns=['col04', 'col05', 'col06']

In [15]:
df # 確認

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [16]:
# renameメソッドでcolumns名の一部を変更
df = df.rename(columns={'col04': 'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [17]:
# renameメソッドでcolumns名の一部を変更（複数）
df = df.rename(columns={'col05': 'y', 'col06': 'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [18]:
# renameメソッドでindex名の一部を変更
df = df.rename(index={'idx01': 'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [19]:
df['x'] # DataFrameから一列取り出す

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [20]:
type(df['x']) # データ型の表示

pandas.core.series.Series

In [21]:
df[['x']] # DataFrameとして一列取り出す

       x
w      1
idx02  4
idx03  7

In [22]:
type(df[['x']]) # データ型の表示

pandas.core.frame.DataFrame

In [23]:
df.loc['w'] # 行名や列名を指定して、行や列を取得

x    1
y    2
z    3
Name: w, dtype: int64

In [25]:
df.loc['w', 'z'] # 行、列を指定して取得。リストで行→列の順

3